'''
คำอธิบาย
เดือน มกราคม,มีนาคม,พฤษภาคม,กรกฎาคม,สิงหาคม,ตุลาคม,ธันวาคม

มี 31 วัน
เดือน เมษายน,มิถุนายน,กันยายน,พฤศจิกายน

มี 30 วัน
เดือน กุมภาพันธ์

มี 28-29 วัน'''
n = int(input())

if n ==4 or n == 6 or n == 9 or n ==11:
    print("30")
elif n == 2:
    print("28-29")
else:
    print("31")

'''# อ่านเลขเดือน (1-12)
m = int(input().strip())

if m == 2:
    print("28-29")
elif m in (4, 6, 9, 11):
    print("30")
elif 1 <= m <= 12:
    print("31")
else:
    print("Invalid month")  # กรณีป้อนค่าไม่ใช่ 1-12
'''